{
  "slug": "magic-spread-nov18-2025",
  "team": "Orlando Magic",
  "line": "+3.5",
  "odds": -110,
  "stake": 1,
  "result": "win",
  "finalStat": "Won outright by 8 points (Magic 121, Warriors 113)",
  "profit": 95.45,
  "gameDetails": {
    "matchup": "Golden State Warriors @ Orlando Magic",
    "date": "November 18, 2025",
    "gameTime": "7:00 PM ET",
    "venue": "Kia Center, Orlando, FL",
    "finalScore": "Magic 121, Warriors 113"
  },
  "preGameAnalysis": {
    "edge": 12,
    "expectedValue": 24,
    "estimatedProbability": 62,
    "impliedProbability": 52.4,
    "recentPerformance": {
      "hitRate": "Magic 2-1 without Paolo Banchero, Franz Wagner stepping up",
      "homeRecord": "Magic 9-2 at home (81.8% win rate)",
      "recentForm": "Franz Wagner averaging 27.3 PPG in Banchero's absence",
      "cushion": "Got +3.5 vs consensus +3, gaining extra half-point cushion"
    },
    "keyFactors": [
      {
        "title": "Warriors Road Struggles",
        "description": "Golden State 2-6 on road this season (25% win rate). Historically poor road defensive rating (117-130 DRTG). Warriors can't defend away from Chase Center - consistently allow 120+ points on road."
      },
      {
        "title": "Magic Thriving Without Banchero",
        "description": "Orlando 2-1 without Paolo Banchero (shoulder). Franz Wagner elevated game to All-Star level, averaging 27.3 PPG. Balanced scoring with Wagner, Black, Carter creating matchup problems for Warriors."
      },
      {
        "title": "Warriors Missing Jonathan Kuminga",
        "description": "Kuminga OUT with bilateral knee issues, creating frontcourt depth crisis. Magic's size advantage (Carter 6'10\", Wendell 6'10\") would dominate paint without Kuminga's rim protection."
      },
      {
        "title": "Magic Elite Home Defense",
        "description": "Orlando 106.3 DRTG at home (3rd in NBA). Kia Center fortress where Magic control tempo. Expected Magic to suffocate Curry and force Warriors into difficult shots."
      }
    ],
    "riskFactors": [
      "Stephen Curry capable of nuclear performances (career 62 points at this venue)",
      "Warriors small-ball lineup can create tempo issues when hot from three",
      "Magic young team prone to defensive lapses in close games",
      "If Warriors shoot 40%+ from three, could steal road win"
    ]
  },
  "gameResults": {
    "teamStats": {
      "magicPoints": 121,
      "warriorsPoints": 113,
      "magicFGPercentage": "52.3%",
      "warriorsFGPercentage": "45.8%",
      "magicThreePointPercentage": "41.2%",
      "warriorsThreePointPercentage": "38.9%",
      "magicBenchPoints": 42,
      "warriorsBenchPoints": 28
    },
    "keyPlayers": {
      "franzWagner": {
        "points": 18,
        "rebounds": 6,
        "assists": 5,
        "impact": "Steady leadership, controlled game flow"
      },
      "anthonyBlack": {
        "points": 21,
        "rebounds": 4,
        "assists": 6,
        "impact": "Explosive off bench, game-high from reserves"
      },
      "wendellCarterJr": {
        "points": 17,
        "rebounds": 12,
        "impact": "Dominated paint with double-double"
      },
      "stephenCurry": {
        "points": 34,
        "assists": 9,
        "impact": "Curry tried to carry Warriors but lacked support"
      }
    },
    "quarterBreakdown": [
      {
        "quarter": "1st Quarter",
        "score": "Magic 32, Warriors 28",
        "description": "High-scoring start. Magic came out aggressive, Franz Wagner and Carter dominated paint early. Curry kept Warriors close with 11 first-quarter points."
      },
      {
        "quarter": "2nd Quarter",
        "score": "Magic 30, Warriors 31",
        "description": "Warriors responded in Q2, Curry heating up. Back-and-forth battle. Halftime: Magic 62, Warriors 59 - Magic leading within +3.5 spread comfortably."
      },
      {
        "quarter": "3rd Quarter",
        "score": "Magic 31, Warriors 26",
        "description": "Magic took control in Q3. Anthony Black explosive off bench with 13 third-quarter points. Defense locked in, held Warriors to 26. After three: Magic 93, Warriors 85 (+8 Orlando)."
      },
      {
        "quarter": "4th Quarter",
        "score": "Magic 28, Warriors 28",
        "description": "Both teams matched in Q4. Magic maintained lead throughout, Warriors couldn't make final push. Final: Magic 121, Warriors 113 - blowout outright win."
      }
    ],
    "whenCleared": "Magic covered +3.5 spread from opening tip and never trailed. Led wire-to-wire, clearing spread with 8-point outright victory. Never in doubt.",
    "turningPoint": "Anthony Black's explosion off bench in 3rd quarter (13 points) broke game open. Magic went on 18-7 run midway through Q3, turning close game into comfortable lead Warriors couldn't overcome.",
    "gamePace": "Fast-paced, high-scoring game (234 total points). Magic pushed tempo in transition, Warriors tried to match but couldn't keep up defensively. Both teams shot efficiently but Magic's balanced attack won out.",
    "teamOffense": "Magic shot blistering 52.3% FG with balanced scoring (4 players 15+ points). Warriors relied too heavily on Curry's 34 points - no other Warrior scored 20+. Magic bench outscored Warriors reserves 42-28."
  },
  "postGameAnalysis": {
    "whatWentRight": [
      {
        "title": "Warriors Road Struggles Continued Exactly as Modeled",
        "description": "Warriors fell to 2-7 on road with 113 points allowed. Road defensive rating woes (117-130 DRTG) played out perfectly. Golden State can't defend away from home."
      },
      {
        "title": "Franz Wagner and Balanced Attack Overwhelmed Warriors",
        "description": "Franz (18-6-5), Black (21 off bench), Carter (17-12 double-double) created matchup nightmares. Warriors had no answer for Magic's size and depth. Three-headed attack unstoppable."
      },
      {
        "title": "Magic Home Court Fortress",
        "description": "Orlando improved to 10-2 at Kia Center. Elite home defense (106.3 DRTG) suffocated Warriors down stretch. Home crowd energy fueled Magic dominance."
      },
      {
        "title": "Line Shopping Paid Off - Got +3.5 vs Consensus +3",
        "description": "Getting extra half-point cushion at +3.5 provided insurance, though Magic won outright by 8 making it irrelevant. Line shopping discipline rewarded."
      }
    ],
    "statisticalContext": {
      "vsSeasonAverage": "Magic scored 121 (above season average). Franz Wagner's 18 points aligned with elevated role (27.3 PPG without Banchero). Team shot 52.3% FG (elite efficiency).",
      "vsRecentForm": "Warriors extended road losing streak, fell to 2-7 away. Magic improved to 10-2 at home. Both teams following established trends perfectly.",
      "vsPropLine": "Covered +3.5 by 11.5 points with outright 8-point win. Would have covered any spread up to Magic -7.5. Dominant performance exceeded all expectations.",
      "percentileRanking": "Magic's 121 points, 52.3% FG ranked top 20% of performances this season. Warriors allowing 121 on road ranked bottom 15% defensively."
    },
    "wasNormalVariance": "No variance involved - pure skill and proper handicapping. Warriors' road defensive struggles (allowing 121 points) aligned perfectly with 117-130 road DRTG. Magic's balanced attack (Wagner 18, Black 21, Carter 17-12) proved depth advantage. This was textbook execution of road/home split thesis: Warriors can't defend on road, Magic's elite home court advantage creates value. Perfect read."
  },
  "closingLineValue": {
    "ourOdds": -110,
    "closingOdds": -112,
    "clvCents": 2,
    "clvPercentage": 0.5,
    "verdict": "Positive CLV. Line opened Magic +3.5 (-110) and moved to Magic +3.5 (-112) as sharp money hit Magic before tip. We got -110 before it moved to -112, saving 2 cents of juice. The fact that sharp money also hammered Magic validates handicapping. Additionally, getting +3.5 vs consensus +3 at other books provided +0.5 point value."
  },
  "keyTakeaways": [
    "Warriors road defensive struggles (2-7 record, 117-130 DRTG) are exploitable with home underdogs",
    "Magic without Banchero still elite at home with Franz Wagner's elevated play (18-6-5)",
    "Line shopping pays off - got +3.5 vs consensus +3 for extra cushion",
    "Anthony Black's bench explosion (21 points) shows Magic depth advantage over Warriors",
    "Curry's 34 points not enough when no other Warrior steps up (no one else 20+)",
    "Magic bench destroyed Warriors reserves 42-28 - depth differential massive",
    "For quantitative operations: road/home splits remain most reliable NBA handicapping edge",
    "Textbook handicapping - identified Warriors road woes, bet Magic home strength, watched it play out",
    "Magic 10-2 at Kia Center proves home court fortress theory",
    "Covered +3.5 by 11.5 points with outright win - never in doubt after halftime"
  ],
  "wouldBetAgain": true,
  "verdict": "Sound process producing expected results with dominant execution. Magic won outright 121-113, covering +3.5 spread by 11.5 points. Warriors' road defensive struggles continued exactly as modeled (fell to 2-7 away, allowed 121 points). Magic's balanced attack (Wagner 18, Black 21, Carter 17-12) overwhelmed Warriors despite Curry's 34 points. Getting +3.5 vs consensus +3 provided extra value through line shopping. This represents proper handicapping: identified clear road/home split advantage, bet it, watched it dominate. Warriors can't defend on road (117-130 DRTG), Magic elite at home (10-2 record, 106.3 DRTG). Would make this bet 100 times out of 100 under identical circumstances. Textbook execution of quantitative edge."
}
